wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/venmo-authorize-transaction-successful.json

{
    "type": "transaction",
    "id": "97f82c76-cabe-4e73-8939-f6241c355a3a",
    "reconciliation_id": "4clFwAJcgYcTGq3UQHlgoU",
    "merchant_account_id": "default",
    "created_at": "2024-09-30T18:39:37.771430+00:00",
    "updated_at": "2024-09-30T18:41:37.852232+00:00",
    "amount": 1000,
    "authorized_amount": 1000,
    "captured_amount": 0,
    "refunded_amount": 0,
    "currency": "USD",
    "settled_currency": null,
    "settled_amount": 0,
    "settled": false,
    "country": "US",
    "external_identifier": "111.1",
    "status": "authorization_succeeded",
    "intent": "authorize",
    "payment_method": {
        "type": "payment-method",
        "method": "venmo",
        "mode": "redirect",
        "label": "@test-venmo-username",
        "scheme": null,
        "expiration_date": null,
        "approval_url": "https:\/\/cdn.sandbox.wikimedia.gr4vy.app\/connections\/braintree\/ui\/venmo.html?authorization=sandbox_pgvgkhzc_ms9fqmw9gxrm2bp3&usage=single_use&returnUrl=https:\/\/api.sandbox.wikimedia.gr4vy.app\/transactions\/approve\/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.l_gsdsq-TnOJOfYkHDVaOg.UkJnr7syIi46ImORfff_HOdBzKf60J16KZWV93Spsbw?gr4vy_store=false",
        "country": "US",
        "currency": "USD",
        "details": null,
        "last_replaced_at": null,
        "fingerprint": null,
        "id": null,
        "approval_target": null,
        "external_identifier": null,
        "payment_account_reference": null
    },
    "method": "venmo",
    "instrument_type": "redirect",
    "error_code": null,
    "payment_service": {
        "id": "567c9bd2-9fc5-4f5d-b6c4-c5504de6080b",
        "type": "payment-service",
        "payment_service_definition_id": "braintree-venmo",
        "method": "venmo",
        "display_name": "Venmo"
    },
    "pending_review": false,
    "buyer": {
        "id": "e595febc-0804-4958-a40f-9366d27e5f8a",
        "type": "buyer",
        "display_name": "Jimmy Wales",
        "external_identifier": "jimmy@example.com",
        "billing_details": {
            "first_name": "Jimmy",
            "last_name": "Wales",
            "email_address": "jimmy@example.com",
            "phone_number": null,
            "address": {
                "city": " ",
                "country": "US",
                "postal_code": " ",
                "state": " ",
                "state_code": null,
                "house_number_or_name": null,
                "line1": " ",
                "line2": " ",
                "organization": " "
            },
            "tax_id": null
        }
    },
    "raw_response_code": null,
    "raw_response_description": null,
    "shipping_details": null,
    "checkout_session_id": null,
    "gift_card_redemptions": [],
    "gift_card_service": null,
    "airline": null,
    "auth_response_code": null,
    "avs_response_code": null,
    "cvv_response_code": null,
    "payment_source": "ecommerce",
    "merchant_initiated": false,
    "is_subsequent_payment": false,
    "cart_items": [],
    "statement_descriptor": null,
    "scheme_transaction_id": null,
    "three_d_secure": null,
    "payment_service_transaction_id": "dHJhbnNhY3Rpb25fajlkY2I4czc",
    "metadata": null,
    "authorized_at": "2024-09-30T18:41:37.852232+00:00",
    "captured_at": null,
    "voided_at": null,
    "approval_expires_at": "2024-09-30T19:09:37.815870+00:00",
    "buyer_approval_timedout_at": null,
    "intent_outcome": "succeeded",
    "multi_tender": false
}