wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/venmo-create-transaction-success.json

{
    "type": "transaction",
    "id": "029d57f8-d07c-4712-b35b-de6f908f170f",
    "reconciliation_id": "4vtEc4uDfHNy7sZwRs3xv",
    "merchant_account_id": "default",
    "created_at": "2024-09-25T14:33:52.669685+00:00",
    "updated_at": "2024-09-25T14:33:56.391553+00:00",
    "amount": 1000000,
    "authorized_amount": 0,
    "captured_amount": 0,
    "refunded_amount": 0,
    "currency": "USD",
    "country": "US",
    "external_identifier": "111.1",
    "status": "buyer_approval_pending",
    "intent": "authorize",
    "payment_method": {
        "type": "payment-method",
        "method": "venmo",
        "mode": "redirect",
        "label": null,
        "scheme": null,
        "expiration_date": null,
        "approval_url": "https:\/\/cdn.sandbox.wikimedia.gr4vy.app\/connections\/braintree\/ui\/venmo.html?authorization=sandbox_pgvgkhzc_ms9fqmw9gxrm2bp3&usage=single_use&returnUrl=https:\/\/api.sandbox.wikimedia.gr4vy.app\/transactions\/approve\/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.Ap1X-NB8RxKzW95vkI8XDw.XyIbJe9-Fbj_eZb-CjSlQXM_8WOAsm3xSoosgSV_4SQ?gr4vy_store=false",
        "country": "US",
        "currency": "USD",
        "details": null,
        "last_replaced_at": null,
        "fingerprint": null,
        "id": null,
        "approval_target": "any",
        "external_identifier": null,
        "payment_account_reference": null
    },
    "method": "venmo",
    "instrument_type": "redirect",
    "error_code": null,
    "payment_service": {
        "id": "66edbbaf-b1e4-4d66-828d-8954655794a6",
        "type": "payment-service",
        "payment_service_definition_id": "braintree-venmo",
        "method": "venmo",
        "display_name": "Venmo"
    },
    "pending_review": false,
    "buyer": {
        "id": "e595febc-0804-4958-a40f-9366d27e5f8a",
        "type": "buyer",
        "display_name": "Jimmy Wales",
        "external_identifier": "jimmy@example.com",
        "billing_details": {
            "first_name": "Jimmy",
            "last_name": "Wales",
            "email_address": "jimmy@example.com",
            "phone_number": null,
            "address": {
                "city": null,
                "country": "US",
                "postal_code": null,
                "state": null,
                "state_code": null,
                "house_number_or_name": null,
                "line1": null,
                "line2": null,
                "organization": null
            },
            "tax_id": null
        }
    },
    "raw_response_code": null,
    "raw_response_description": null,
    "shipping_details": null,
    "checkout_session_id": null,
    "gift_card_redemptions": [],
    "gift_card_service": null,
    "airline": null,
    "auth_response_code": null,
    "avs_response_code": null,
    "cvv_response_code": null,
    "payment_source": "ecommerce",
    "merchant_initiated": false,
    "is_subsequent_payment": false,
    "cart_items": [],
    "statement_descriptor": null,
    "scheme_transaction_id": null,
    "three_d_secure": null,
    "payment_service_transaction_id": "c45da5a5-6e9b-4a28-9cab-24df49525121",
    "metadata": null,
    "authorized_at": null,
    "captured_at": null,
    "voided_at": null,
    "approval_expires_at": "2024-09-25T15:03:52.717928+00:00",
    "buyer_approval_timedout_at": null,
    "intent_outcome": "pending",
    "multi_tender": false
}